Feature: надання актуальних місць розташування чистого повітря
  As a Жертва-споживач
  In order to отримати розташування природних зон
  I want to використовувати функціонал сайту

  Scenario 1: Створення нового запису
    Given Жертва-споживач авторизується за даними облікової записи Google
    And його дані є актуальними
    When Жертва-споживач авторизуэться за допомогою Google акаунту
    Then реєструємо Жертву-споживача на сервісі
    And спостерігаємо профіль в системі

  Scenario 2: Авторизація за існуючим аккаунтом
    Given Жертва-споживач вже має власний профіль
    And профіль є у системі
    When Жертва-споживач вносить дані для авторизації
    And дані для авторизації Жертви-споживача коректні
    Then надаємо доступ до послугам
    And реєструємо інформацію про поточний сеанс

  Scenario 3: Пошук інформації на сайті
    Given Жертва-споживач вже має власний профіль
    And профіль є у системі
    When Жертва-споживач робить запрос на пошук природних зон
    And дані для авторизації Жертви-споживача коректні та є доступ до геолокації клієнта
    Then робимо запит на пошук природних зон
    And видаємо інформацію та записуємо запит у історію запитів