Feature: менеджер з надання дозвілу
  As a Жертва-споживач
  In order to отримати дозвіл для участі у спортивних змагань
  I want to використовувати функціонал сайту

  Scenario 1: Створення нового запису
    Given Жертва-споживач авторизується за даними облікової записи Google
    And його дані є актуальними
    When Жертва-споживач авторизуэться за допомогою Google акаунту
    Then реєструємо Жертву-споживача на сервісі
    And спостерігаємо профіль в системі

  Scenario 2: Авторизація за існуючим аккаунтом
    Given Жертва-споживач вже має власний профіль
    And профіль є у системі
    When Жертва-споживач вносить дані для авторизації
    And дані для авторизації Жертви-споживача коректні
    Then надаємо доступ до послугам
    And реєструємо інформацію про поточний сеанс

  Scenario 3: Запит дозволу для участі
    Given Жертва-споживач вже має власний профіль
    And профіль є у системі
    When Жертва-споживач робить запрос на отримання дозвілу
    And дані для авторизації Жертви-споживача коректні та є необхідна інформація для надання запиту
    Then робимо запит на отримання дозволу
    And видаємо відповідь щодо отримання дозволу після того як прийметься рішення