Feature: Авторизувати користувача
  As a Жертва-споживач
  In order to авторизуватись на сайті охоронного агентства
  I want to використовувати функціонал сайту

  Scenario 1: Створення нового запису
    Given Жертва-споживач створює новий запис
    And його дані є актуальними
    When Жертва-споживач вносить особистрі дані
    Then реєструємо Жертву-споживача на сервісі
    And спостерігаємо профіль в системі

  Scenario 2: Авторизація за існуючим аккаунтом
    Given Жертва-споживач вже має власний профіль
    And профіль є у системі
    When Жертва-споживач вносить дані для авторизації
    And дані для авторизації Жертви-споживача коректні
    Then надаємо доступ до послугам
    And реєструємо інформацію про поточний сеанс